app/Views/layout/v_header.php

SELECT *
FROM `tbl_data_user`
WHERE `id_user` IS NULL
---
<?php
$db = \Config\Database::connect();

$user = $db->table('tbl_data_user')
->where('id_user',session()->get('id_user'))
->get()->getRowArray();