app/Models/M_home.php

SELECT COUNT(*) AS `numrows` FROM `data_penyewaan_ps`
---
    public function tot_ps()
    {
        return $this->db->table('data_penyewaan_ps')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_data_user`
---
    public function tot_pengguna()
    {
        return $this->db->table('tbl_data_user')->countAll();