app/Models/M_sewa.php

    public function get_sewa()
    {
        return $this->db->table('data_penyewaan_ps')
            ->get()->getResultArray();
---
SELECT *
FROM `data_penyewaan_ps`